---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsFlexDuctTypeParam
source: html/ba80135b-18e2-ed2d-071e-1c37ce9910d6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsFlexDuctTypeParam Property

"Flex Duct Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsFlexDuctTypeParam { get; }
```